---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeyBasedTreeEntryTable
source: html/76a81015-4f11-f33c-7470-1565fe3c7db7.htm
---
# KeyBasedTreeEntryTable Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.